{-
    2. Напишите функцию, определяющую, принадлежит ли точка N(x,y,z)
 шару с центром в точке (1.5,200,-4.12) и R=72.8, если x, y, z - за-
 данные действительные числа.
-}

f x y z =
    if x <= 1.5 + 72.8 && x >= 1.5 - 72.8 
        then if y <= 200.0 + 72.8 && y >= 200.0 - 72.8
            then if z <= (-4.12) + 72.8 && z >= (-4.12) - 72.8
                then True
                else False
            else False
        else False

test1 = f 1.5 200.0 (-4.12) == True
test2 = f (-74) 200 (-4.12) == False
